surfaceWater/runCases/RANS_3D/3mmx0.1mm/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.0008;

boundaryField
{
    front
    {
        type    kqRWallFunction;
        value   uniform 0.000084; 
    }

    back
    {
        type    kqRWallFunction;
        value   uniform 0.000084; 
    }

    right
    {
        type    cyclicAMI;
    }

    left
    {
        type    cyclicAMI;
    }

    top
    {
        type    zeroGradient;
    }

    bottom
    {
        type    kqRWallFunction;
        value	uniform 0.000084; // k = 3/2(u')^2 ; u' = 0.05U
    }
}


// ************************************************************************* //
